{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Part-time",
      "description": "Seeking a Senior React Developer to lead the development of cutting-edge web applications. Leverage your extensive experience in React to architect scalable solutions and mentor junior developers. Collaborate closely with cross-functional teams to deliver high-quality software products. If you're a proactive leader passionate about pushing boundaries, join us.",
      "location": "London",
      "salary": "£90K - 100K",
      "date": "2024-04-13T18:56:53.483Z",
      "company": {
        "name": "SwiftMasters Solutions",
        "description": "SwiftMasters Solutions is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "2",
      "title": "Front-End Engineer (React & Redux)",
      "type": "Hybrid",
      "location": "Cambridge",
      "description": "Seeking a skilled Front-End Engineer proficient in React and Redux to enhance user interfaces and drive innovation. Collaborate with cross-functional teams to develop scalable, responsive web applications. If you're passionate about crafting exceptional user experiences and thrive in a dynamic environment, join us in shaping the future of technology.",
      "salary": "£70K - 80K",
      "date": "2024-04-13T18:53:10.910Z",
      "company": {
        "name": "SmartLink",
        "description": "SmartLink  is a creative agency specializing in digital design and development. Our team is dedicated to pushing the boundaries of creativity and innovation to deliver exceptional results for our clients.",
        "contactEmail": "contact@loremipsum.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "3",
      "title": "Junior React Developer ",
      "type": "Remote",
      "location": "Leeds",
      "description": "Looking for a Junior React Developer to contribute to the development of dynamic web applications. Work closely with senior developers to gain hands-on experience in React development. Opportunity to learn and grow within a supportive team environment. If you're eager to kick-start your career in React, apply now!",
      "salary": "Under $50K",
      "date": "2024-04-13T18:58:39.912Z",
      "company": {
        "name": "CloudDream",
        "description": "CloudDream is a leading technology company specializing in digital solutions for businesses of all sizes. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "contact@dolorsitamet.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "4",
      "title": "React Front-End Developer",
      "type": "Part-time",
      "description": "Looking for a talented React Front-End Developer to create engaging user interfaces. Utilize your expertise in React to build responsive web applications, collaborating closely with design and backend teams. If you're passionate about delivering top-notch user experiences and thrive in a collaborative environment, we'd love to hear from you.",
      "location": "Liverpool",
      "salary": "£60K - 70K",
      "date": "2024-04-13T19:21:57.552Z",
      "company": {
        "name": "CloudFlair",
        "description": "CloudFlair is a dynamic startup specializing in digital marketing and web development. We are committed to fostering a diverse and inclusive workplace where creativity and innovation thrive.",
        "contactEmail": "contact@adipisicingelit.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "5",
      "title": "Full Stack React Developer",
      "type": "Remote",
      "description": "Exciting opportunity for a Full-Time Front-End Developer in bustling Manchester, UK. We are seeking a talented individual with a passion for building elegant and scalable web applications. Join our team and make an impact!",
      "location": "Manchester",
      "salary": "£70K - 80K",
      "date": "2024-04-13T18:59:49.738Z",
      "company": {
        "name": "Sprint Technologies",
        "description": "Sprint Technologies is a rapidly growing technology company specializing in e-commerce solutions. We offer a dynamic and collaborative work environment where employees are encouraged to think creatively and innovate.",
        "contactEmail": "contact@consecteturadipisicing.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "6",
      "title": "React Native Developer",
      "type": "Full-time",
      "description": "Join our team as a Front-End Developer in beautiful London, UK. We are looking for a skilled and enthusiastic individual to help us create innovative web solutions. Competitive salary and great benefits package available.",
      "location": "London",
      "salary": "£100K - 125K",
      "date": "2024-04-13T19:22:26.210Z",
      "company": {
        "name": "Smart Solutions INC",
        "description": "Smart Solutions is a leading technology company specializing in software development and digital marketing. We are committed to providing our clients with cutting-edge solutions and our employees with a supportive and rewarding work environment.",
        "contactEmail": "contact@ipsumlorem.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "18a6",
      "title": "Full Stack Senior React/Typescript Developer",
      "type": "Full-time",
      "salary": "£125K - 150K",
      "location": "London",
      "description": "We are seeking a talented Full Stack  React/Typescript Developer to join our team in London, UK. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, Typescript, SQL with at least 5 years experience working with modern JavaScript frameworks ad SQL.",
      "date": "2024-04-13T19:35:40.456Z",
      "company": {
        "name": "CodeCrafters Technologies",
        "description": "At CodeCrafters Technologies, we're more than just software developers — we're creators, innovators, and problem solvers. We specialize in crafting bespoke digital solutions tailored to your needs, leveraging cutting-edge technologies to bring your ideas to life. Whether you're a startup looking to disrupt the market or an enterprise seeking to streamline operations, we're here to empower your journey with our expertise and dedication. Let's build the future together, one line of code at a time.",
        "contactEmail": "info@codecrafters.tech",
        "contactPhone": "0458584587072"
      }
    },
    {
      "id": "572a",
      "title": "Junior Front-end Developer",
      "type": "Full-Time",
      "salary": "Under $50K",
      "location": "Leeds",
      "description": "Seeking a Junior Front-end Developer to assist in building responsive, user-centric web applications. Collaborate with experienced developers to learn and grow your skills in HTML, CSS, and JavaScript frameworks. Opportunity to gain practical experience and contribute to exciting projects in a supportive team environment. Apply now to jumpstart your career!",
      "date": "2024-04-18T18:02:20.073Z",
      "company": {
        "name": "NexGen Innovations",
        "description": "NexGen Innovations pioneers cutting-edge solutions at the intersection of technology and creativity. With a relentless focus on innovation, we craft bespoke software products that redefine industries. Our dynamic team thrives on pushing boundaries, delivering transformative digital experiences that inspire and empower. Welcome to the future with NexGen Innovations.",
        "contactEmail": "contact@nexgeninnovations.com",
        "contactPhone": "075432151234"
      }
    }
  ]
}